---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData.GetCoordination
source: html/6e96e640-5ef6-c8d1-d04a-cac0a4cfccca.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData.GetCoordination Method

Gets the coordination of the connector

## Syntax (C#)
```csharp
public Transform GetCoordination()
```

## Returns
The coordination of the connector